{
  "Admin": [
    {
      "username": "admin",
      "password": "1111",
      "_id": "mpmfr33x"
    }
  ],
  "Client": [],
  "Round": [
    {
      "_id": "gu2r2lgk",
      "rounds": {
        "lobby": true,
        "round1": false,
        "round2": false
      },
      "round1EndTime": null,
      "round2EndTime": null,
      "globalPassword": "1",
      "imgRoundConfig": {
        "q1Img": "\\assets\\q1.png",
        "q1Ans": "A realistic photograph of a green apple placed on a white plate on a kitchen table, indoor setting, even natural lighting, sharp focus, high detail",
        "q2Img": "\\assets\\q2.png",
        "q2Ans": "A realistic photograph of a black cat sitting on a wooden table near a window, daylight coming through the window, indoor setting, natural lighting, high detail, sharp focus",
        "q3Img": "\\assets\\q3.png",
        "q3Ans": "A cinematic realistic photograph of an abandoned hospital corridor at night, flickering fluorescent lights, peeling paint and broken tiles, a wheelchair left in the middle of the hallway, long shadows, eerie atmosphere, cool color tones, shallow depth of field",
        "timerDuration": 0
      },
      "textRoundConfig": {
        "q1": "Mira found an abandoned rooftop in her apartment building and decided to grow flowers there. She had no gardening experience, and at first the plants barely survived the sun and wind. Every day, she carefully tended them, adjusting the soil and watering in small amounts. Slowly, the rooftop bloomed with colors, attracting birds and even the neighbors’ attention. By the end of the season, Mira realized that her small, hidden effort had created a tiny oasis of beauty and happiness for herself and the community.",
        "q1Ans": "Write a story about a young woman named Mira who discovers an unused rooftop, experiments with gardening despite her inexperience, and gradually transforms it into a colorful space that brings happiness to herself and her neighbors",
        "q2": "A QR-based self-billing system allows customers to scan products and generate bills themselves.\nThis reduces queue time and staff workload in retail shops.\nThe system supports digital payments without requiring POS machines.\nIt is cost-effective and suitable for small and medium businesses.",
        "q2Ans": "Describe a QR-based self-billing system in a 4-line paragraph, highlighting its benefits for small shops in simple language.",
        "q3": "Short-interval polling is a communication method where a client repeatedly requests data from a server at fixed time intervals.\nThe server responds immediately whether new data is available or not.\nThis approach is easy to implement using standard HTTP requests.\nHowever, frequent requests can increase server load and reduce efficiency.",
        "q3Ans": "Explain short-interval polling in a simple and technical tone, using a 4-line paragraph, and include one advantage and one disadvantage.",
        "timerDuration": 0
      }
    }
  ]
}